00100      IDENTIFICATION DIVISION.                                    
00200      PROGRAM-ID. HELLO.                                           
00300      PROCEDURE DIVISION.                                               
00400         DISPLAY "Hello Cobol!".
00500      STOP RUN.