       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. GOOSE_CPT
       PROCEDURE DIVISION.
           A00-FIRST-PARA.
                   DISPLAY "STRUCTURE OF A COBOL PROGRAM".
                   DISPLAY 'Hello, world'.

           A00-SECOND-PARA.
                   DISPLAY "GOOSE".
       STOP RUN.
