      * This is a function which will be used in 8_Subroutines.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. GET-SUM-IMPORTING-FROM-FOLDER.
       ENVIROMNENT DIVISION.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LNum1 PIC 99 VALUE 5.
       01 LNum2 PIC 9 VALUE 5.
       01 LSum1 PIC 99.

       FILE SECTION.

       WORKING-STORAGE DIVISION.


       PROCEDURE DIVISION.


       STOP RUN.