       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUB-ROUTINES.
       ENVIROMNENT DIVISION.
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE DIVISION.
       01 Num1 PIC 9 VALUE 5.
       01 Num2 PIC 9 VALUE 5.
       01 Sum1 PIC 99.

       PROCEDURE DIVISION.


       STOP RUN.